#include <a_samp>
#include <streamer>
public OnFilterScriptInit()
{
    //--MAPLAR--//
  new tmpobjid;

	//bamas kulüP
	tmpobjid = CreateDynamicObject(3095, 1807.161987, -1717.836059, 12.026863, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1807.161987, -1717.836059, 11.956861, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1759.057861, -1721.741699, 8.074057, 0.000000, -89.599975, 89.800048, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1750.364746, -1708.842163, 10.981524, 0.000000, -13.900002, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1750.364746, -1699.902709, 10.981524, 0.000000, -13.900002, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1750.364746, -1690.933227, 10.981524, 0.000000, -13.900002, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1750.364746, -1681.990478, 10.981524, 0.000000, -13.900002, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1750.364746, -1717.822265, 10.981524, 0.000000, -13.900002, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1768.031250, -1721.772949, 8.074057, 0.000000, -89.599975, 89.800048, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1759.112304, -1682.868164, 8.074510, 0.000000, -89.599975, -90.300056, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	tmpobjid = CreateDynamicObject(3095, 1768.167480, -1682.912963, 8.074510, 0.000000, -89.599975, -90.300056, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 10101, "2notherbuildsfe", "Bow_Abpave_Gen", 0x00000000);
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	tmpobjid = CreateDynamicObject(-3007, 1792.625732, -1680.257934, 19.496873, 0.000000, 0.000000, -90.199867, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(8661, 1791.641845, -1692.309448, 12.526874, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(8661, 1774.542602, -1692.309448, 12.586875, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(8661, 1774.542602, -1712.280273, 12.586875, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);

	//cankurtaran kulübe
	tmpobjid = CreateDynamicObject(-3012, 200.482070, -1873.478881, 3.330915, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 245.442199, -1873.463012, 3.021368, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 289.132202, -1873.488525, 3.520638, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 337.512420, -1873.488525, 3.520638, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 445.182525, -1873.508422, 3.910071, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 498.422851, -1873.533447, 4.399357, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 553.333740, -1873.564941, 5.008470, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3012, 609.655944, -1873.583984, 5.367946, 3.099999, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);

	//holywood tabela
	tmpobjid = CreateDynamicObject(-3008, 1418.278564, -804.784729, 84.289604, 90.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	SetDynamicObjectMaterial(tmpobjid, 0, 19517, "noncolored", "gen_white", 0x00000000);
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	tmpobjid = CreateDynamicObject(-3010, 1421.373168, -805.037353, 86.809791, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3009, 1418.847290, -804.963745, 84.746467, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);

	//Elektronik unitystion
	tmpobjid = CreateDynamicObject(-3005, 1845.771606, -1855.636962, 16.002838, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(-3006, 1891.833740, -1872.271240, 14.894337, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(5043, 1843.310913, -1856.301513, 13.801284, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);

	//casino
	tmpobjid = CreateDynamicObject(-3013, 1498.141235, -1578.385009, 32.122940, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);
	tmpobjid = CreateDynamicObject(1569, 1497.658203, -1580.141113, 12.546875, 0.000000, 0.000000, 0.000000, -1, -1, -1, 900.00, 900.00);


	print("\n--------------------------------------");
	print(" Exterior'lar Yüklenmiþtir.");
	print("--------------------------------------\n");
	return 1;
}

public OnFilterScriptExit()
{
	return 1;
}
